<template>
  <view>
    <u-navbar :is-back="true" title="服务协议"> </u-navbar>
    <div class="wrapper" :style="{ paddingTop: capsuleBottom + 'px' }">
      <div class="aboutBox">
        <p>一、服务条款的确认及接受</p>
        <p>(一)  青橙网站（指北京青橙叁佰陆拾度电子商务有限公司及其关联方合法拥有并运营的相关网站及客户端应用程序，以下称“本网站”或“青橙平台”或“平台”）各项电子服务的所有权和运作权归属于“青橙”所有，本网站提供的服务将完全按照其发布的服务条款和操作规则严格执行。您确认所有服务条款并完成注册程序时，本协议在您与本网站间成立并发生法律效力，同时您成为本网站正式用户。</p>
        <p>(二) 青橙平台运营主体可能根据平台业务调整而发生变更或新增，您可随时查看青橙平台各网站首页底部公示的证照信息以确定与您履约的青橙主体。</p>
        <p>(三) 青橙平台隐私政策、平台规则、单独协议均为本协议的补充协议，与本协议不可分割且具有同等法律效力。如您使用青橙平台服务，视为您同意上述补充协议。</p>
        <p>(四) 您在使用本网站某一特定服务时，该服务可能会另有单独的协议、相关业务规则等（以下统称为“单独协议”），您在使用该项服务前请阅读并同意相关的单独协议，您使用前述特定服务，即视为您已阅读并同意接受相关单独协议。</p>
        <p>(五)  根据国家法律法规变化及本网站运营需要，青橙有权对本协议条款及相关规则不时地进行修改，修改后的内容依法定程序公示后生效，并取代此前相关内容，您应不时关注本网站公告、提示信息及协议、规则等相关内容的变动。您应承诺遵守青橙主站实时公布的相关协议和平台规则（如违规订单处理规则、违规行为规则、违规青橙账号处理等），上述文件客户可在“青橙主站”-“客户服务”-“帮助中心”中进行查询或下载。您知悉并确认，如您不同意更新后的内容，应立即停止使用本网站；如您继续使用本网站，即视为知悉变动内容并同意接受。</p>
        <p>(六)  除非另有明确的书面说明,青橙不对本网站的运营及其包含在本网站上的信息、内容、材料、产品（包括软件）或服务作任何形式的、明示或默示的声明或担保（根据中华人民共和国法律另有规定的以外）。</p>
        <p>(七)  本协议内容中以加粗方式显著标识的条款，请您着重阅读。您点击“同意”按钮即视为您完全接受本协议，在点击之前请您再次确认已知悉并完全理解本协议的全部内容。</p>
        <p>二、服务须知</p>
        <p>(一) 本网站运用自身开发的操作系统通过国际互联网络为用户提供购买商品等服务。使用本网站，您必须：</p>
        <p>1、自行配备上网的所需设备，包括手机、平板电脑、调制解调器、路由器等；</p>
        <p>2、自行负担上网所支付的与此服务有关的电话费用、网络费用等；</p>
        <p>3、选择与所安装终端设备相匹配的软件版本，包括但不限于IOS、Android、Windows等多个青橙发布的应用版本。</p>
        <p>(二) 关于移动客户端软件的获取与更新：</p>
        <p>1、您可以直接从青橙网站上获取青橙移动客户端软件，也可以从青橙授权的第三方获取，如果您从未经青橙授权的第三方获取软件或与青橙移动客户端软件名称相同的安装程序，青橙无法保证该软件能够正常使用，并对因此给您造成的损失不予负责；</p>
        <p>2、为了改善用户体验、完善服务内容，青橙将不断努力开发新的服务，并为您不时提供软件更新，新版本发布后，旧版本的软件可能无法使用，青橙不保证旧版本软件继续可用及相应的客户服务，请您随时核对并下载最新版本。</p>
        <p>三、账户注册、管理及使用</p>
        <p>(一) 用户资格</p>
        <p>您确认，在您开始注册程序使用青橙平台服务前，您应当具备中华人民共和国法律规定的与您的行为相适应的民事行为能力。</p>
        <p>您确认您以手机号或邮箱等方式登陆平台的账号管理员已获得您的足够授权，代表您全权办理本平台的账号注册、变更、注销、采购、文件签署等您在青橙平台的一切操作，所做出的意思表示和平台操作结果，您均予以承认。</p>
        <p>(二) 账户注册</p>
        <p>1、您按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，您可获得青橙平台账户并成为青橙平台用户。您设置的青橙账号名/昵称/头像等不得违反国家法律法规及青橙平台相关规则关于账号注册的管理规定，未经他人许可不得用他人名义（包括但不限于冒用他人姓名、名称、字号、头像等或采取其他足以让人引起混淆的方式）开设账号，不得恶意注册青橙账号。</p>
        <p>2、如有证据证明或青橙根据青橙平台规则判断您存在不当注册或不当使用多个青橙平台账户的情形，青橙平台可采取冻结或注销您的账号、取消订单、拒绝提供服务等措施，如给青橙平台及相关方造成损失的，您还应承担赔偿责任。</p>
        <p>3、在使用青橙平台服务时，您应当按青橙平台页面的提示准确完整地提供您的信息（包括您的名称及电子邮件地址、联系人、联系电话、联系地址等），以便青橙或其他服务方与您联系。您了解并同意，您有义务保持您提供信息的真实性及有效性。</p>
        <p>(三) 账户登录</p>
        <p>您有权使用您设置或确认的青橙用户名、手机号码（以下简称“账户名称”）及您设置的密码（账户名称及密码合称“账户”）或通过授权使用您合法拥有的第三方软件或平台用户账号（如微信账号、QQ账号等）登录青橙平台，但第三方软件或平台对此有限制或禁止的除外。当您以前述已有账号登录使用的，同样适用本协议中的相关条款。</p>
        <p>您理解并同意，除您登录青橙平台以外，您还可以使用青橙账号登录青橙及其关联方或其他合作方提供的其他软件、服务。您以青橙账号登录前述服务的，同样应受其他软件、服务实际提供方的用户协议及其他协议条款约束。</p>
        <p>(四) 实名认证</p>
        <p>为使您更好地使用青橙平台的各项服务，保障您的账户安全，青橙可要求您按照相关法律法规规定完成企业实名认证。</p>
        <p>(五) 更新维护</p>
        <p>1、当您登记的信息有变更时，如账号管理员手机号或邮箱等有调整，您应及时更新平台中相关信息，由于您的企业信息维护管理缺失所导致的权益受损，需由您自行承担。</p>
        <p>2、在法律有明确规定要求青橙作为平台服务提供者必须对部分用户的信息进行核实的情况下，青橙将依法不时地对您的信息进行检查核实，您应当配合提供最新、真实、完整、有效的信息。</p>
        <p>3、如青橙按您最后一次提供的信息与您联系未果、您未按青橙的要求及时提供信息、您提供的信息存在明显不实或行政司法机关核实您提供的信息无效的，您将承担因此对您自身、他人及青橙造成的全部损失与不利后果。青橙可向您发出询问或要求整改的通知，并要求您进行重新认证，直至中止、终止对您提供部分或全部青橙平台服务，青橙对此不承担责任。</p>
        <p>(六) 账户管理</p>
        <p>1、由于您的青橙平台账户关联您的主体信息及青橙平台商业信息，您的青橙平台账户仅限您使用，您应对您账户下的所有行为结果负责，不得以任何方式转让，否则青橙平台有权追究您的违约责任，且由此产生的责任及后果均由您自行承担。您直接或间接授权第三方使用您青橙平台账户或获取您账户项下信息的行为后果亦由您自行承担。如青橙根据青橙平台规则中约定的违约认定程序及标准判断您青橙平台账户的使用可能危及您的账户安全及/或青橙平台信息安全的，青橙平台可拒绝提供相应服务或终止本协议。</p>
        <p>2、您的账户为您自行设置并由您保管，青橙任何时候均不会主动要求您提供您的账户密码。因此，建议您务必保管好您的账户，并确保您在每个上网时段结束时退出登录并以正确步骤离开青橙平台。</p>
        <p>3、账户因您主动泄露或因您遭受他人攻击、诈骗等行为导致的损失及后果，青橙并不承担责任，您应通过司法、行政等救济途径向侵权行为人追偿。如发现任何未经授权使用您账户登录青橙平台或其他可能导致您账户遭窃、遗失的情况，建议您立即通知青橙，您理解青橙对您的任何请求采取行动均需要合理时间，且青橙应您请求而采取的行动可能无法避免或阻止侵害后果的形成或扩大，除青橙存在法定过错外，青橙不承担责任。</p>
        <p>4、您理解并同意，为充分使用账号资源，如您在注册后未及时进行初次登录使用或连续12个月未登录任一青橙平台，且不存在未到期的有效业务的，青橙有权收回您的账号，您可能无法通过您此前持有的账号登录青橙平台，您该账号下任何个性化设置（如头像/昵称）即将无法恢复。在收回您的账号之前，青橙将以适当方式做出提示，如您在收到相关提示后一定期限内仍未登录、使用账号，青橙将收回账号。</p>
        <p>(七) 账号注销</p>
        <p>如您需要终止使用青橙账号服务，符合以下条件的，您可以申请注销您的账号：</p>
        <p>1、您仅能申请注销您的账号，并依照《青橙企业账号注销须知》进行注销；</p>
        <p>2、您仍应对您在注销账号前使用青橙账号服务期间的行为承担责任。</p>
        <p>特别提示您，您申请注销账户的，视为您同意放弃账户信息以及该账户在平台的资产、虚拟权益（包括但不限于账户余额、E卡余额、京豆、优惠券等），且青橙无法为您恢复前述服务，这可能对您主张售后服务带来不便。</p>
        <p>四、青橙平台服务</p>
        <p>您有权在青橙平台上享受商品及/或服务的浏览、收藏、购买与评价、配送和交付、平台活动、交易争议处理、信息交流及分享等服务，详情您可登录青橙平台查看。</p>
        <p>(一) 商品及/或服务的浏览、收藏</p>
        <p>在您浏览我们网站或客户端的过程中，青橙为您提供了信息分类、关键词检索、筛选、收藏及关注等功能，以更好地匹配您的需求。您可以对您感兴趣的商品及/或服务进行收藏、添加至购物车，关注您所感兴趣的店铺/品牌等。</p>
        <p>(二) 商品及/或服务的购买与评价</p>
        <p>1、当您在青橙平台购买商品及/或服务时，请您仔细确认所购商品的名称、价格、数量、型号、规格、尺寸、联系地址、电话、收货人等信息。收货人的行为和意思表示视为您的行为和意思表示，您应对收货人的行为及意思表示的法律后果承担连带责任。</p>
        <p>2、您的购买行为应当符合法律规定，为采购自用需求购买、使用商品或者接受服务，不得存在对商品及/或服务实施恶意购买、恶意维权等扰乱青橙平台正常交易秩序的行为。基于维护青橙平台交易秩序及交易安全的需要，青橙发现上述情形时可主动执行包括但不限于暂停或停止服务、取消订单等青橙认为有必要的管控措施及作出账户处置等操作。</p>
        <p>3、您理解并同意：本网站上销售商展示的商品和价格等信息仅仅是要约邀请，您下单时须填写您希望购买的商品数量、价款及支付方式、收货人、联系方式、收货地址（合同履行地点）、合同履行方式等内容；系统生成的订单信息是计算机信息系统根据您填写的内容自动生成的数据，仅是您向销售商发出的合同要约；销售商收到您的订单信息后，只有在销售商将您在订单中订购的商品从仓库实际直接向您发出时（以商品出库为标志），方视为您与销售商之间就实际直接向您发出的商品建立了合同关系；如果您在一份订单里订购了多种商品并且销售商只给您发出了部分商品时，您与销售商之间仅就实际直接向您发出的商品建立了合同关系，只有在销售商实际直接向您发出了订单中订购的其他商品时，您和销售商之间就订单中其他已实际直接向您发出的商品才成立合同关系；对于电子书、数字音乐、在线手机充值等数字化商品，您下单并支付货款后合同即成立。</p>
        <p>4、尽管销售商做出最大的努力，但由于市场变化及各种以合理商业努力难以控制因素的影响，本网站无法避免您提交的订单信息中的商品出现缺货、价格标示错误等情况；如您下单所购买的商品出现以上情况，您有权取消订单，销售商亦有权自行取消订单，若您已经付款，则为您办理退款。</p>
        <p>5、您理解并同意：平台系统有权自动判定用户下单行为异常或存在风险而自动拦截并取消和删除相关订单，若您已经付款，则为您办理退款。</p>
        <p>6、您有权在青橙平台提供的评价系统中对与您达成交易的其他用户商品及/或服务进行评价。您应当理解，您在青橙平台的评价信息是公开的，如您不愿意在评价信息中向公众披露您的身份信息，您有权选择通过匿名形式发表评价内容。</p>
        <p>7、为确保评价内容能为采购人的采购决策提供可靠的依据，反映商品及/或服务的真实情况，您的所有评价行为应遵守青橙平台规则的相关规定，评价内容应当合法、客观、真实，与交易的商品及/或服务具有关联性，且不应包含任何污言秽语、色情低俗、广告信息及法律法规与本协议列明的其他禁止性信息；您不应以不正当方式帮助他人提升信用或利用评价权利对其他用户实施威胁、敲诈勒索。青橙可按照青橙平台规则的相关规定对您实施上述行为所产生的评价信息采取必要处置措施。</p>
        <p>(三) 配送和交付</p>
        <p>您在本网站购买的商品将按照本网站上您所指定的送货地址进行配送。订单信息中列出的送货时间为参考时间，参考时间的计算是根据库存状况、正常的处理过程和送货时间、送货地点的基础上估计得出的。您应当清楚准确地填写您的送货地址、联系人及联系方式等配送信息，您知悉并确认，您所购买的商品应仅由您填写的联系人接受身份查验后接收商品，因您变更联系人或相关配送信息而造成的损失由您自行承担。</p>
        <p>因如下情况造成订单延迟或无法配送等，本网站将无法承担迟延配送或无法配送的责任：</p>
        <p>1、客户提供错误信息和不详细的地址；</p>
        <p>2、货物送达无人签收或拒收，由此造成的重复配送所产生的费用及相关的后果；</p>
        <p>3、不可抗力，例如：自然灾害及恶劣天气、交通戒严等政府、司法机关的行为、决定或命令、意外交通事故、罢工、法规政策的修改、恐怖事件、抢劫、抢夺等暴力犯罪、突发战争等；</p>
        <p>4、您在本网站购买的商品由青橙的关联方或第三方配送公司（包括顺丰、圆通等，以下称“配送公司”）为您完成订单交付的，系统或单据记录的签收时间为交付时间；您购买的商品采用在线传输方式交付的，销售商向您指定系统发送的时间为交付时间；您购买服务的，生成的电子或者实物凭证中载明的时间为交付时间；</p>
        <p>5、销售商依您订单确定的收货信息配送至指定地点并向指定收货人交付，商品一经签收即视为交付，您应当场对商品品类、规格、型号、数量和包装等商品表面状况进行验收。您应及时收取货物，如您对商品质量有异议的，应于商品交付后及时内向销售商提出，销售商根据实际情况及时处理。</p>
        <p>(四) 结算方式和发票</p>
        <p>1、您在平台提交有效采购订单，结算方式应在平台提示的结算方式范围内自主选择；</p>
        <p>2、您应保证提交的开票信息及付款信息的真实性与准确性，并保证实际付款方与申请开票方一致，否则造成的一切损失由您自行承担，给青橙造成实际损失的，您应承担相应赔偿责任；</p>
        <p>3、您收到发票后应及时跟销售商确认发票送达情况，超过7日未核实，则视为您已确认收到发票。您应及时就已要求开具增值税专用发票进行认证抵扣，如因您的原因超期未抵扣，由此产生全部责任或损失均由您承担。</p>
        <p>(五) 平台活动</p>
        <p>平台会不定期开展各类活动，参与活动前，您应当进入相应活动页面仔细阅读、充分理解活动规则，您参与活动的，视为您已充分阅读、理解该活动规则，并自愿受活动规则的约束。阅读活动规则的过程中，如果您不理解或不同意其中的任何内容，请停止参与相关活动。您理解并同意，如您的订单或您参与的活动违反限制性要求的，则青橙有权采取取消订单、取消活动资格，撤销活动奖励等一项或多项处理措施而无须承担任何责任。</p>
        <p>(六) 交易争议处理</p>
        <p>您在青橙平台交易过程中与其他用户发生争议的，您或其他用户中任何一方均有权选择以下途径解决：</p>
        <p>1、与争议相对方自主协商；</p>
        <p>2、使用青橙平台提供的客户服务；</p>
        <p>3、向有关行政部门投诉；</p>
        <p>4、根据与争议相对方达成的仲裁协议（如有）提请仲裁机构仲裁；</p>
        <p>5、向人民法院提起诉讼。</p>
        <p>您理解并同意，青橙平台的客服并非专业人士，仅能以普通人的认知对用户提交的凭证进行判断。因此，除存在故意或重大过失外，青橙不对争议解决结果承担责任。如您对争议解决结果不满意，您仍有权采取其他争议处理途径解决争议。</p>
        <p>(七) 信息交流及分享</p>
        <p>为满足用户间分享购物心得等信息交流需求，您可通过青橙提供的问答、晒单分享、群组及其他信息发布功能进行评论、回复、留言、点赞等公开发布信息及与其他用户互动，您须确保您所发布的所有信息均符合相关法律法规及本协议的要求。</p>
        <p>五、用户个人信息保护及授权</p>
        <p>(一) 您知悉并同意，为方便您使用本网站相关服务，本网站将存储您在使用时的必要信息，包括但不限于您的授权采购人或收货人真实姓名、性别、生日、配送地址、联系方式、通讯录、相册、日历、定位信息等。除法律法规规定的情形外，未经您的许可青橙不会向第三方公开、透露您留存的相关个人信息。青橙对相关信息采取专业加密存储与传输方式，利用合理措施保障用户个人信息的安全。如青橙平台网站或客户端未设置独立隐私政策但使用了青橙平台账号登陆相应网站或客户端的，为保护您的隐私权，我们将参照适用青橙隐私政策的要求对您留存的相关个人信息进行收集、存储、使用、披露和保护。青橙希望通过隐私政策向您清楚地介绍青橙对您留存个人信息的处理方式，因此青橙建议您完整地阅读隐私政策，以帮助您更好地保护您的隐私权。</p>
        <p>(二) 您充分理解并同意：</p>
        <p>1、您理解并同意，通过邮件、短信、电话、消息等平台渠道形式接收相关订单信息、促销活动、商品推荐等内容；您有权通过您的手机号码或者电子邮箱获取您感兴趣的商品广告信息、促销优惠等商业性信息、推广或信息（包括商业或非商业信息）；您如果不愿意接收此类信息，您有权通过青橙提供的相应的退订功能进行退订。</p>
        <p>2、为配合行政监管机关、司法机关执行工作，在法律规定范围内青橙有权向上述行政、司法机关提供您在使用本网站时所储存的相关信息，包括但不限于您的注册信息等，或使用相关信息进行证据保全，包括但不限于公证、见证等。</p>
        <p>3、青橙依法保障您在安装或使用过程中的知情权和选择权，在您使用本网站服务过程中，涉及您设备自带功能的服务会提前征得您同意，您一经确认，青橙有权开启包括但不限于收集地理位置、读取通讯录、使用摄像头、启用录音等提供服务必要的辅助功能。</p>
        <p>4、青橙有权根据实际情况，在法律规定范围内自行决定单个用户在本网站及服务中数据的最长储存期限以及用户日志的储存期限，并在服务器上为其分配数据最大存储空间等。</p>
        <p>六、用户行为规范</p>
        <p>(一) 您同意严格遵守法律法规规章规定，依法遵守以下义务：</p>
        <p>1、不得制作、传输或发表以下违法信息资料：反对宪法所确定的基本原则，煽动抗拒、破坏宪法和法律法规实施的；危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的，煽动推翻社会主义制度的；损害国家荣誉和利益的；歪曲、丑化、亵渎、否定英雄烈士事迹和精神，侵害英雄烈士的姓名、肖像、名誉、荣誉的；宣扬或煽动实施恐怖主义、极端主义及其活动的；煽动民族仇恨、民族歧视、破坏民族团结的言论；破坏国家宗教政策，宣扬邪教和封建迷信的；散布谣言，扰乱经济秩序和社会秩序的；散布淫秽、色情、暴力或者教唆犯罪的；侮辱或者诽谤他人，侵害他人名誉、隐私和其他合法权益的；法律、行政法规禁止的其他内容。</p>
        <p>2、防范和抵制制作、复制、发布含有下列内容的不良信息资料：标题严重夸张，发表内容与标题严重不符的；不当评述自然灾害、重大事故等灾难的；煽动人群歧视、地域歧视等的；宣扬低俗、庸俗、媚俗内容的；违反社会公德行为的；侵犯未成年人合法权益的；其他对网络生态造成不良影响的内容。</p>
        <p>(二) 本协议依据国家相关法律法规规章制定，您亦同意严格遵守以下义务：</p>
        <p>1、从中国大陆向境外传输资料信息时必须符合中国有关法规</p>
        <p>2、不得利用本网站从事洗钱、窃取商业秘密、窃取个人信息等违法犯罪活动；</p>
        <p>3、不得传输或发表任何违法犯罪的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的、不文明的等信息资料；</p>
        <p>4、不得教唆他人从事违法违规或本协议、平台规则所禁止的行为；</p>
        <p>5、不得利用在本网站注册的账户进行不当利益获取、恶意攻击、违法经营活动、传播不良内容等违反法律法规的行为；</p>
        <p>6、不得违反青橙主站相关规则的违规订单行为，包括但不限于刷单、作弊、“薅羊毛”（“薅羊毛”现象泛指以低成本甚至零成本套取高额奖励或优惠等现象）、低价转售、回购、利用系统漏洞恶意套取青橙公司利益等行为；</p>
        <p>7、不得以青橙分销商/青橙合作伙伴名义，或以任何可能引起误解其为青橙分销商/青橙合作伙伴的方式，对外展示、推广或宣传的；</p>
        <p>8、不得以任何方式将基于本协议向青橙采购的商品进行二次销售的；</p>
        <p>9、不得发布任何侵犯他人个人信息、著作权、商标权等知识产权或合法权利的内容；</p>
        <p>10、不得冒充他人或利用他人的名义使用青橙软件服务或传播任何信息，恶意使用注册账号导致其他用户误认的；</p>
        <p>11、不得存在可能破坏、篡改、删除、影响青橙平台任何系统正常运行或未经授权秘密获取青橙平台及其他用户的数据、个人资料的病毒、木马、爬虫等恶意软件、程序代码的；</p>
        <p>12、不得发布其他对网络生态造成不良影响的内容，及法律、行政法规禁止的其他内容。</p>
        <p>(三) 您须对自己在网上的言论和行为承担法律责任，您若在本网站上散布和传播反动、色情或其它违反国家法律的信息，本网站的系统记录有可能作为您违反法律的证据。青橙可对您发布的信息依法或依本协议进行删除或屏蔽。</p>
        <p>(四) 除非法律允许或青橙书面许可，您使用本网站过程中不得从事下列行为：</p>
        <p>1、删除本网站及其副本上关于著作权的信息；</p>
        <p>2、对本网站进行反向工程、反向汇编、反向编译，或者以其他方式尝试发现本网站的源代码；</p>
        <p>3、对青橙拥有知识产权的内容进行使用、出租、出借、复制、修改、链接、转载、汇编、发表、出版、建立镜像站点等；</p>
        <p>4、对本网站或者本网站运行过程中释放到任何终端内存中的数据、网站运行过程中客户端与服务器端的交互数据，以及本网站运行所必需的系统数据，进行复制、修改、增加、删除、挂接运行或创作任何衍生作品，形式包括但不限于使用插件、外挂或非经青橙授权的第三方工具/服务接入本网站和相关系统；</p>
        <p>5、通过修改或伪造网站运行中的指令、数据，增加、删减、变动网站的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播，无论这些行为是否为商业目的；</p>
        <p>6、通过非青橙开发、授权的第三方软件、插件、外挂、系统，登录或使用本网站及服务，或制作、发布、传播上述工具；</p>
        <p>7、自行或者授权他人、第三方软件对本网站及其组件、模块、数据进行干扰。</p>
        <p>(五) 针对您的批量采购或定制商品需求，销售商开展备货行为后，如您未经销售商书面同意擅自取消采购需求或订单等违约行为，由此产生全部责任或损失均由您承担。</p>
        <p>七、违约责任</p>
        <p>(一) 发生如下情形之一的，视为您违约：</p>
        <p>1、使用青橙平台服务时违反有关法律法规规定的；</p>
        <p>2、违反本协议或本协议补充协议（即本协议第一条第3款）约定的；</p>
        <p>3、为适应电子商务发展和满足海量用户对高效优质服务的需求，您理解并同意，青橙可在青橙平台规则中约定违约认定的程序和标准。如：青橙可依据您的登录信息、用户数据与海量用户数据的关系及普通采购人的正常采购、交易习惯、快递物流行业习惯、商业常识等因素来认定您是否构成违约；您有义务对您的数据异常现象进行充分举证和合理解释，否则将被认定为违约。</p>
        <p>(二) 违约处理措施</p>
        <p>如果青橙发现或收到他人举报投诉您违反本协议约定或存在任何恶意行为的，青橙有权不经通知随时对相关内容进行删除、屏蔽，并视行为情节对违规账号处以包括但不限于警告、取消未完结的订单、限制或禁止使用部分或全部功能。</p>
        <p>您在青橙平台上实施的行为，或虽未在青橙平台上实施但对青橙平台及其用户产生影响的行为构成违约的，青橙可依据相应规则对您中止提供部分或全部服务、划扣违约金等处理措施。如您的行为构成根本违约的，青橙可关闭、注销您的账户，终止向您提供服务。</p>
        <p>青橙有权对您上述违约行为处理措施信息以及其他经国家行政或司法机关生效法律文书确认的违法信息在青橙平台上予以公示。</p>
        <p>(三) 赔偿责任</p>
        <p>如您的行为使青橙及/或其关联公司遭受损失（包括自身的直接经济损失、商誉损失及对外支付的赔偿金、诉讼费等间接经济损失），您应赔偿青橙及/或其关联公司的上述全部损失。如您的行为使青橙及/或其关联公司遭受第三人主张权利，青橙及/或其关联公司可在对第三人承担金钱给付等义务后就全部损失向您追偿。</p>
        <p>八、协议终止</p>
        <p>(一) 终止的情形</p>
        <p>您有权通过以下任一方式终止本协议：</p>
        <p>1、在满足青橙平台公示的账户注销条件时您通过网站告知的方式注销您的账户；</p>
        <p>2、变更事项生效前您停止使用并明示不愿接受变更事项的；</p>
        <p>3、您明示不愿继续使用青橙平台服务，且符合青橙平台终止条件的。</p>
        <p>出现以下情况时，青橙可以本协议约定通知您终止本协议：</p>
        <p>1、您违反本协议约定，青橙依据违约条款终止本协议的；</p>
        <p>2、您盗用他人账户、发布违禁信息、骗取他人财物、扰乱市场秩序、采取不正当手段谋利等行为，青橙依据青橙平台规则对您的账户予以关闭的；</p>
        <p>3、除上述情形外，因您多次违反青橙平台规则相关规定且情节严重，青橙依据青橙平台规则对您的账户予以关闭的；</p>
        <p>4、其它应当终止服务的情况。</p>
        <p>(二) 协议终止后的处理</p>
        <p>本协议终止后，青橙仍享有下列权利：</p>
        <p>1、依照法律规定保留平台应当留存的相关信息；</p>
        <p>2、对于您过往的违约行为，青橙仍可依据本协议向您追究违约责任；</p>
        <p>3、本协议终止后，对于您在本协议存续期间产生的交易订单，青橙可通知交易相对方并根据交易相对方的意愿决定是否关闭该等交易订单；如交易相对方要求继续履行的，则您应当就该等交易订单继续履行本协议及交易订单的约定，并承担因此产生的任何损失或增加的任何费用。</p>
        <p>九、所有权及知识产权</p>
        <p>(一) 您一旦接受本协议，对于您提供、上传、创作、发布在本网站的文字、评论、图片、照片、视频、音频等任何形式的信息内容（包括但不限于客户评价、客户咨询、各类话题文章等），您免费授予青橙及其关联公司至保护期终止为止、不可撤销的、全球范围的、排他的许可使用著作权（包括并不限于：复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权以及应当由著作权人享有的其他可许可使用的权利）、肖像权、用户ID名称等相关的全部合法权利权益，就青橙具有诉讼主体资格的权利、权益，青橙有权以自身名义对第三方侵权行为取证及提起诉讼。您同意青橙及其关联公司有权存储、使用、复制、修订、编辑、发布、展示、翻译、分发、推广、出版、发行、信息网络传播您以上信息内容，有权改编制作派生作品，并以已知或日后开发的形式、媒体或技术将上述信息纳入其它作品内。</p>
        <p>(二) 青橙有权再许可给其他第三方第九条第一款的所有权利。</p>
        <p>(三) 您应确保在青橙网站上发表的第九条第一款各类信息内容均不涉及侵犯第三方肖像、隐私、知识产权或其他合法权益。否则青橙有权随时采取包括但不限于删除、断开链接等措施。</p>
        <p>(四) 本协议已经构成《中华人民共和国著作权法》第二十六条（条文序号依照2020年修订版《著作权法》确定）及相关法律规定的著作财产权等权利许可使用的书面协议，其效力及于您在本网站上发布的任何受著作权法保护的作品内容，无论该等内容形成于本协议订立前还是本协议订立后。</p>
        <p>(五) 您同意并已充分了解本协议的条款，承诺不将已发表于本网站的信息，以任何形式发布或授权其它主体以任何方式使用（包括但不限于在各类网站、媒体上使用）。</p>
        <p>(六) 除法律另有强制性规定外，未经青橙明确的特别书面同意,任何单位或个人不得以任何方式非法地全部或部分复制、转载、引用、链接、抓取或以其他方式使用本网站的信息内容，否则，青橙有权追究其法律责任。</p>
        <p>(七) 本网站所刊登的资料信息（包括但不限于文字、图表、标识、按钮图标、图像、照片、声音视频文件及其片段、数字下载物、数据编辑和软件），均是青橙或其内容提供者的财产，受中国著作权法和国际版权相关条约的保护。本网站上所有内容的汇编是青橙的专有财产，受中国著作权法和国际版权相关条约的保护。本网站上所有软件都是青橙或其关联公司或其软件供应商的财产，受中国著作权法和国际版权相关条约的保护。</p>
      </div>
    </div>
  </view>
</template>
<script>
export default {
  data() {
    return {
      navTitle: '',
      capsuleBottom: null,
    };
  },
  mounted() {},
  onLoad(option) {
    uni.getSystemInfo({
      success: () => {
        this.capsuleBottom = uni.getMenuButtonBoundingClientRect().bottom + 8;
      },
    });
  }
};
</script>
<style lang="scss">
/deep/ page{
    background: #f8f8f8;
}
</style>
<style lang="scss" scoped>
@import './index.scss';
.wrapper {
  padding: 16rpx;
}
</style>
