package com.itheima.demo1;

/**
 * @author Euphoria
 * @version 1.0
 * @description: TODO
 * @date 2025/7/27 上午10:12
 */
/*
    类：用来描述事物具有哪些 属性和 行为，设计对象也就是定义类。
        属性：也叫成员变量，写在类中方法外的变量，用来说明对象可以保存什么数据。
        行为：也叫成员方法，描述对象有什么功能，也就是可以对数据进行什么样的处理，
    对象：根据 类 new出来的实体，是一种特殊的数据结构，用来保存一个事物的数据，每new一次都会得到一个新的对象。

    面向对编程的实现思路：
        第一步：定义类，在类中定义属性和行为
        第二步：根据类创建对象，通过对象访问属性和行为。

    类和对象的关系：类是对对象的属性和行为的描述，对象是类的具体体现。手机图纸(类)和手机(对象)之间的关系
    面向对象编程：在一个类种访问另一个类的对象的属性和行为的方式就叫面向对象编程
 */
public class Demo1 {
    public static void main(String[] args) {

        //第二步：根据类创建对象，通过对象访问属性和行为。
        Star s1 = new Star();

        // 赋值 语法：对象名.属性名 = 值
        s1.name = "张三";
        s1.age = 18;
        s1.height = 1.8;
        s1.weight = 80.5;

        // 获取属性值 语法：对象名.属性名
        System.out.println(s1.name + " " + s1.age + " " + s1.height + " " + s1.weight);

        //调用对象的方法 语法：对象名.方法名();
        s1.say();

    }
}
